# frozen_string_literal: true

# Applications will be installed to /Applications
cask_args appdir: '/Applications'

# ====================
# Taps
# ====================
tap 'leoafarias/fvm'           # Flutter Version Management
tap 'mobile-dev-inc/tap'       # Mobile development tools

# ====================
# Formulae
# ====================

# Version Control & Collaboration
brew 'gh'                      # GitHub CLI
brew 'git'                     # Version control system
brew 'git-filter-repo'         # Git history rewriting tool

# Shell & Terminal
brew 'starship'                # Cross-shell prompt
brew 'tmux'                    # Terminal multiplexer
brew 'zsh-autosuggestions'     # Fish-like autosuggestions for zsh
brew 'zsh-syntax-highlighting' # Fish shell like syntax highlighting

# Core Utilities
brew 'bat'                     # Cat clone with syntax highlighting
brew 'coreutils'               # GNU core utilities
brew 'curl'                    # Command line tool for transferring data
brew 'gawk'                    # GNU awk
brew 'gnu-sed'                 # GNU implementation of sed
brew 'jq'                      # Command-line JSON processor
brew 'ripgrep'                 # Fast grep replacement
brew 'tree'                    # Directory listing as tree
brew 'wget'                    # Internet file retriever
brew 'yq'                      # YAML processor

# Language & Runtime Managers
brew 'asdf'                    # Multi-language version manager
brew 'fvm'                     # Flutter version management
brew 'pipx'                    # Python package runner
brew 'python-tk'               # Python Tkinter

# Databases & Data Stores
brew 'libpq'                   # PostgreSQL library
brew 'mysql'                   # MySQL database
brew 'postgresql@18'           # PostgreSQL database
brew 'redis'                   # In-memory data structure store

# Cloud & DevOps
brew 'act'                     # Run GitHub Actions locally
brew 'localstack'              # Local AWS cloud stack emulator
brew 'overmind'                # Memory overcommitment tool
brew 'saml2aws'                # Login to AWS using SAML
brew 'terraformer'             # Generate terraform files from existing infrastructure

# Mobile Development
brew 'fastlane'                # iOS & Android deployment tool
brew 'ios-deploy'              # iOS deploying tool
brew 'maestro'                 # Mobile e2e testing tool
brew 'watchman'                # File watching service

# Graphics & Media Processing
brew 'cairo'                   # Vector graphics library
brew 'giflib'                  # GIF library
brew 'imagemagick'             # Image manipulation library
brew 'jpeg'                    # JPEG library
brew 'libpng'                  # PNG library
brew 'librsvg'                 # SVG library
brew 'pango'                   # Text layout engine
brew 'pixman'                  # Low-level pixel manipulation
brew 'yt-dlp'                  # YouTube video downloader

# AI & Automation
brew 'gemini-cli'              # Gemini AI client
brew 'mcp-proxy'               # MCP Proxy
brew 'ollama'                  # Local LLMs

# System Utilities & Misc
brew 'blueutil'                # Bluetooth CLI
brew 'gibo'                    # .gitignore boilerplates
brew 'gpg'                     # GNU Privacy Guard
brew 'libyaml'                 # YAML parser
brew 'mas'                     # Mac App Store CLI
brew 'num-utils'               # Number utilities
brew 'pkg-config'              # Package compiler/linker helper
brew 'readline'                # Command-line editing library
brew 'rename'                  # File renaming tool
brew 'telnet'                  # Telnet client
brew 'terminal-notifier'       # Send macOS notifications from the command line
brew 'wimlib'                  # Windows Imaging library

# ====================
# Applications (Casks)
# ====================

# Security & Privacy
cask '1password'               # Password manager
cask '1password-cli'           # 1Password CLI
cask 'expressvpn'              # VPN client

# Development & Runtime
cask 'android-studio'          # Android IDE
cask 'docker-desktop'          # Container platform
cask 'iterm2'                  # Terminal emulator
cask 'postman'                 # API development
cask 'react-native-debugger'   # React Native debugging
cask 'tableplus'               # Database management
cask 'visual-studio-code'      # Code editor
cask 'cursor'                  # AI-powered IDE
cask 'xcodes-app'              # Xcode version manager
cask 'zulu'                    # OpenJDK distribution

# Browsers
cask 'firefox@nightly'         # Firefox Nightly
cask 'google-chrome'           # Chrome browser
cask 'chatgpt-atlas'           # ChatGPT in browser
cask 'microsoft-edge'          # Edge browser

# Productivity & Organization
cask 'cleanmymac'              # System cleaner
cask 'karabiner-elements'      # Keyboard customizer
cask 'meetingbar'              # Calendar meetings in menu bar
cask 'menubarx'                # Menubar browser
cask 'notion'                  # Note taking & collaboration
cask 'notion-calendar'         # Calendar integration for Notion
cask 'obsidian'                # Note-taking app
cask 'raycast'                 # Command palette & productivity tool

# Communication
cask 'discord'                 # Chat & communities
cask 'slack'                   # Team communication
cask 'zoom'                    # Video conferencing

# Office Suite
cask 'microsoft-excel'         # Spreadsheet
cask 'microsoft-outlook'       # Email client
cask 'microsoft-word'          # Word processor

# Design & Creative
cask 'adobe-creative-cloud'    # Adobe suite
cask 'drawio'                  # Diagram software
cask 'figma'                   # Design tool

# Cloud Storage & Sync
cask 'google-drive'            # Google Drive

# Language & Translation
cask 'deepl'                   # Translation tool
cask 'google-japanese-ime'     # Japanese input

# Utilities
cask 'cyberduck'               # FTP client
cask 'keyboardcleantool'       # Keyboard cleaning utility
cask 'licecap'                 # Screen recorder

# Virtualization & Device Tools
cask 'parallels'               # Virtual machine platform

# Entertainment
cask 'guitar-pro'              # Guitar tablature editor
cask 'spotify'                 # Music streaming

# AI Tools
cask 'kiro-cli'                # Amazon Q AI assistant
cask 'chatgpt'                 # ChatGPT client
cask 'claude'                  # Claude AI client
cask 'claude-code'             # Claude Code AI client
cask 'codex'                   # Codex AI client

# Task
brew "go-task/tap/go-task"     # Task runner
