# frozen_string_literal: true

cask_args appdir: '/Applications'

# tap
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# brew
brew 'act'
brew 'asdf'
brew 'bat'
brew 'cairo'
brew 'curl'
brew 'fastlane'
brew 'gawk'
brew 'gh'
brew 'gibo'
brew 'giflib'
brew 'git'
brew 'git-filter-repo'
brew 'gnu-sed'
brew 'gpg'
brew 'imagemagick'
brew 'ios-deploy'
brew 'jpeg'
brew 'jq'
brew 'libpng'
brew 'libpq'
brew 'librsvg'
brew 'libyaml'
brew 'localstack'
brew 'mas'
brew 'num-utils'
brew 'pango'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql@14'
brew 'python-tk'
brew 'readline'
brew 'rename'
brew 'starship'
brew 'terraformer'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'wimlib'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# cask
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-studio'
cask 'cleanmymac'
cask 'clipy'
cask 'cyberduck'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'eset-cyber-security-pro'
cask 'expressvpn'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'guitar-pro'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboardcleantool'
cask 'licecap'
cask 'logi-options-plus'
cask 'meetingbar'
cask 'menubarx'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-word'
cask 'notion'
cask 'postman'
cask 'parallels'
cask 'react-native-debugger'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'
cask 'zulu'
